Revit 2027 API
IndependentTag.LeaderStartCondition Property
 The leader start condition of the tag, such as if the start of the leader is attached to the tag head or free floating.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LeaderStartCondition LeaderStartCondition { get; set; }
Public Property LeaderStartCondition As LeaderStartCondition
	Get
	Set
public:
property LeaderStartCondition LeaderStartCondition {
	LeaderStartCondition get ();
	void set (LeaderStartCondition value);
}
member LeaderStartCondition : LeaderStartCondition with get, set
Property Value
LeaderStartCondition
Exceptions
Exception | Condition
ArgumentException |  When setting this property: LeaderStartCondition can't be assigned.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
InvalidOperationException |  The IndependentTag object does not have a tag behavior. -or- When setting this property: For this tag leaders are not allowed.
Remarks
LeaderStartCondition enumerates the supported leader start conditions. Leaders for material tags and material keynotes can only use the attached start condition.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace